{
  "services": {
    "shopifyDev": {
      "title": "SHOPIFY DEVELOPMENT",
      "desc": "Custom Shopify themes and Liquid template development for European merchants. From single-store setups to Shopify Plus enterprise solutions and headless Hydrogen storefronts built for scale.",
      "longDesc": "Shopify powers over four million stores worldwide, and for good reason. We build custom Shopify experiences that go far beyond off-the-shelf themes, crafting pixel-perfect storefronts that reflect your brand identity and convert visitors at rates well above platform averages. Our Shopify development team works with Liquid, Shopify CLI, and the full theme architecture to deliver stores that are fast, accessible, and optimised for European shoppers.\n\nFor merchants who have outgrown basic themes, we develop bespoke Liquid templates with custom sections, dynamic metafield integrations, and advanced filtering logic. Every design decision is informed by conversion data. We implement OS 2.0 theme architecture so your marketing team can update layouts, banners, and product showcases without touching code.\n\nShopify Plus clients benefit from our expertise in checkout extensibility, Shopify Functions for custom discount logic, and multi-storefront management. We configure expansion stores for each European market with localised currencies, languages, and tax rules. Shopify Markets Pro integration ensures compliance with EU VAT regulations across France, Germany, the Netherlands, Belgium, and the UK.\n\nFor brands that demand ultimate performance, we build headless storefronts using Hydrogen and Remix. This decoupled approach delivers sub-second page loads, full creative freedom on the frontend, and the reliability of Shopify's backend for inventory, checkout, and payments. Combined with Oxygen hosting, your store gets edge-deployed across Europe for minimal latency.",
      "f1": "Custom Liquid theme development with OS 2.0 architecture",
      "f2": "Shopify Plus checkout extensibility and Shopify Functions",
      "f3": "Headless Hydrogen and Remix storefront development",
      "f4": "Multi-storefront setup for European market expansion",
      "f5": "Shopify Markets Pro with EU VAT and duty compliance",
      "f6": "Custom app development using Shopify Admin and Storefront APIs",
      "f7": "Migration from WooCommerce, Magento, or PrestaShop to Shopify",
      "f8": "Performance optimisation targeting sub-2-second load times",
      "step1": "Discovery and platform audit. We evaluate your product catalogue, market requirements, and growth goals to determine the optimal Shopify plan and architecture.",
      "step2": "Theme design and prototyping. Custom wireframes and visual designs are created, reviewed, and refined with your team before any development begins.",
      "step3": "Development sprint with Liquid templating, app integrations, payment gateway setup, and European market configuration including currencies and tax rules.",
      "step4": "Launch preparation with full QA testing, performance benchmarking, staff training on the Shopify admin, and post-launch monitoring for 30 days."
    },
    "wooDev": {
      "title": "WOOCOMMERCE DEVELOPMENT",
      "desc": "WordPress e-commerce with WooCommerce, custom plugin development, European payment gateway integration, and full EU regulatory compliance for VAT, GDPR, and consumer protection.",
      "longDesc": "WooCommerce remains the most flexible open-source e-commerce platform available, powering over 30 percent of all online stores globally. We build WooCommerce stores that leverage this flexibility to create tailored shopping experiences for European merchants, with deep customisation that proprietary platforms simply cannot match. Our team handles everything from theme development to custom plugin engineering.\n\nEvery WooCommerce store we deliver includes properly configured European payment gateways. We integrate Mollie for iDEAL and Bancontact, Stripe for card payments across all EU markets, and Klarna for buy-now-pay-later functionality that European shoppers increasingly expect. Payment flows are tested across multiple currencies and verified for PSD2 Strong Customer Authentication compliance.\n\nFor businesses with specific operational needs, we develop custom WooCommerce plugins rather than stacking third-party solutions. This approach reduces plugin conflicts, improves performance, and gives you features built precisely for your workflow. Common custom developments include B2B pricing engines, subscription management, and integration with European ERP systems like SAP Business One or Exact Online.\n\nEU compliance is built into every store from the foundation. We configure WooCommerce Tax for automatic VAT calculation across all EU member states, implement the EU VAT Number field for B2B transactions with reverse charge mechanism, and ensure GDPR-compliant data handling with proper consent flows, data export, and right-to-erasure functionality.",
      "f1": "Custom WooCommerce theme development with Gutenberg blocks",
      "f2": "European payment gateways: Mollie, Stripe, Klarna, Adyen",
      "f3": "Custom plugin development for unique business requirements",
      "f4": "EU VAT compliance with automatic calculation and validation",
      "f5": "GDPR-compliant customer data handling and consent management",
      "f6": "ERP and CRM integration with European business systems",
      "f7": "WooCommerce Subscriptions and recurring payment setup",
      "f8": "Performance optimisation with caching and CDN configuration",
      "step1": "Requirements analysis covering your product types, shipping zones, tax obligations, and integration needs with existing business systems across your European markets.",
      "step2": "Theme design with WooCommerce-specific UX patterns. Product pages, category layouts, and checkout flows are designed for maximum conversion.",
      "step3": "Development with payment gateway configuration, tax automation, shipping zone setup, and custom plugin development for any unique business logic.",
      "step4": "Testing with real transactions across all configured payment methods and currencies, followed by launch, staff training, and 30 days of technical support."
    },
    "customEcom": {
      "title": "CUSTOM E-COMMERCE",
      "desc": "Fully bespoke online stores built with React frontends and headless commerce architecture. Tailored checkout flows, custom product configurators, and integrations designed for your exact business model.",
      "longDesc": "When off-the-shelf platforms cannot accommodate your business logic, custom e-commerce is the answer. We build fully bespoke online stores using React and TypeScript on the frontend, connected to headless commerce engines like Medusa.js, Saleor, or Commercetools on the backend. This architecture gives you complete control over the customer experience while leveraging battle-tested commerce infrastructure.\n\nCustom e-commerce is ideal for businesses with complex product configurations, unique pricing models, or checkout flows that standard platforms cannot support. We have built configurators for custom manufacturing, subscription boxes with variable contents, and marketplace platforms connecting multiple sellers. The frontend is entirely yours to define, unconstrained by theme limitations or platform conventions.\n\nOur headless approach delivers exceptional performance. React-based storefronts load in under one second, with static generation for product pages and dynamic rendering only where needed. Image optimisation, code splitting, and edge caching ensure your store performs flawlessly across European markets regardless of user location. This speed directly translates to higher conversion rates.\n\nEvery custom store includes robust API integrations with your existing business ecosystem. We connect to warehouse management systems, accounting software like Xero or QuickBooks, CRM platforms, and European shipping providers including DPD, GLS, PostNL, and Colissimo. Real-time inventory synchronisation ensures your online and offline channels stay aligned.",
      "f1": "React and TypeScript frontend with server-side rendering",
      "f2": "Headless commerce with Medusa.js, Saleor, or Commercetools",
      "f3": "Custom product configurators and dynamic pricing engines",
      "f4": "Tailored checkout flows optimised for your conversion goals",
      "f5": "API integrations with ERP, CRM, and warehouse systems",
      "f6": "Multi-vendor marketplace architecture when required",
      "f7": "Real-time inventory sync across online and offline channels",
      "f8": "Edge-deployed for sub-second load times across Europe",
      "step1": "Business process mapping to understand your unique requirements, existing systems, and the specific limitations that make custom development necessary.",
      "step2": "Architecture design selecting the optimal headless backend, defining API contracts, and creating detailed frontend wireframes and interaction prototypes.",
      "step3": "Agile development in two-week sprints with continuous deployment to a staging environment. Each sprint delivers testable functionality.",
      "step4": "Integration testing, load testing for peak traffic scenarios, data migration from your existing platform, and phased rollout with monitoring."
    },
    "b2bEcom": {
      "title": "B2B E-COMMERCE",
      "desc": "Business-to-business commerce platforms with bulk ordering, custom pricing tiers, quote request systems, and account management portals built for European wholesale and distribution businesses.",
      "longDesc": "B2B e-commerce has fundamentally different requirements from consumer retail. Your buyers expect personalised pricing, bulk ordering capabilities, credit terms, and procurement workflows that integrate with their purchasing systems. We build B2B platforms that meet these expectations while delivering the smooth user experience that modern business buyers demand.\n\nOur B2B stores feature sophisticated pricing engines that support customer-specific price lists, volume discounts with tiered breakpoints, negotiated contract pricing, and automatic trade discounts. Buyers log into their accounts and see only the products and prices relevant to their agreement. Quote request workflows allow sales teams to handle complex orders that require human review before confirmation.\n\nAccount management portals give your B2B customers autonomy over their purchasing. Features include order history with one-click reorder, invoice access and download, delivery tracking, multi-user accounts with approval hierarchies, and budget management tools. These self-service capabilities reduce your support burden while improving customer satisfaction.\n\nFor European B2B operations, we handle the regulatory complexity. Automatic EU VAT validation using VIES, reverse charge mechanism for cross-border B2B sales, Intrastat reporting data capture, and SEPA direct debit for recurring orders. Integration with European logistics providers ensures accurate shipping quotes and tracking for palletised freight and parcel shipments alike.",
      "f1": "Customer-specific pricing with tiered volume discounts",
      "f2": "Quote request and approval workflow system",
      "f3": "Multi-user accounts with purchasing hierarchies and budgets",
      "f4": "Bulk ordering with CSV upload and quick-order forms",
      "f5": "EU VAT validation via VIES with reverse charge automation",
      "f6": "Invoice management with PDF generation and SEPA integration",
      "f7": "ERP synchronisation for real-time stock and pricing updates",
      "f8": "Punchout catalogue support for enterprise procurement systems",
      "step1": "B2B requirements workshop covering your pricing models, customer segments, order workflows, and integration needs with existing ERP and accounting systems.",
      "step2": "Platform architecture and pricing engine design. We map every customer tier, discount rule, and approval workflow before development begins.",
      "step3": "Development of the storefront, account portal, admin panel, and integrations. Weekly demos ensure the platform matches your operational requirements.",
      "step4": "Customer onboarding support, data migration from spreadsheets or legacy systems, sales team training, and performance monitoring during initial adoption."
    },
    "multiCurrency": {
      "title": "MULTI-CURRENCY STORES",
      "desc": "EU-wide e-commerce with automatic currency conversion, localised pricing strategies, per-country tax compliance, and native shopping experiences for customers across all European markets.",
      "longDesc": "Selling across European borders means navigating a complex landscape of currencies, tax rules, and consumer expectations. We build multi-currency stores that make cross-border selling seamless, presenting each customer with prices in their local currency, familiar payment methods, and compliant tax handling. The result is a native shopping experience regardless of whether your customer is in Paris, Amsterdam, or Berlin.\n\nOur multi-currency implementation goes beyond simple conversion. We configure market-specific pricing strategies that account for local purchasing power, competitive positioning, and psychological price points. A product priced at EUR 49.95 in Germany might be GBP 44.99 in the UK and CHF 52.00 in Switzerland. Each market gets deliberate pricing, not just exchange rate arithmetic.\n\nTax compliance is the hidden complexity of cross-border e-commerce. We implement automatic VAT calculation based on the customer's delivery country, handling standard rates, reduced rates for specific product categories, and the EUR 10,000 distance selling threshold that determines where you must register for VAT. For businesses exceeding thresholds, we configure OSS (One-Stop-Shop) reporting to simplify your EU-wide VAT obligations.\n\nPayment localisation dramatically improves conversion rates. Dutch customers expect iDEAL, Belgian shoppers use Bancontact, German buyers prefer Klarna and SOFORT, while French customers reach for Carte Bancaire. We integrate all major European payment methods through providers like Mollie and Adyen, ensuring every customer can pay the way they prefer.",
      "f1": "Market-specific pricing with local currency display",
      "f2": "Automatic VAT calculation per EU member state",
      "f3": "OSS (One-Stop-Shop) compliance for cross-border VAT",
      "f4": "Localised payment methods: iDEAL, Bancontact, Klarna, SOFORT",
      "f5": "Geo-detection for automatic market and language selection",
      "f6": "Multi-language product catalogues with localised descriptions",
      "f7": "Country-specific shipping rates and delivery estimates",
      "f8": "Currency hedging strategy consultation for price stability",
      "step1": "Market analysis to identify your target countries, required currencies, applicable VAT rates, and preferred local payment methods for each market.",
      "step2": "Pricing strategy development with market-specific price points, rounding rules, and promotional frameworks that work across all configured currencies.",
      "step3": "Store configuration with multi-currency checkout, tax automation, payment gateway setup for each market, and geo-detection logic for automatic localisation.",
      "step4": "Cross-border testing with real transactions in each currency and payment method, VAT verification, and compliance review before full market launch."
    },
    "paymentInt": {
      "title": "PAYMENT INTEGRATION",
      "desc": "Seamless integration of European payment providers including Stripe, Mollie, Adyen, PayPal, iDEAL, Bancontact, and SEPA direct debit with full PSD2 compliance and 3D Secure authentication.",
      "longDesc": "Payment processing is the most critical component of any e-commerce store. A failed payment means a lost sale, and European consumers expect their preferred local payment methods to be available. We integrate payment solutions that maximise conversion rates across all European markets while ensuring full regulatory compliance with PSD2 and Strong Customer Authentication requirements.\n\nOur expertise spans the major European payment service providers. Stripe for comprehensive card processing and its growing suite of local payment methods. Mollie for Dutch and Belgian merchants who need iDEAL and Bancontact as primary options. Adyen for enterprise merchants requiring a single integration across dozens of payment methods. We select and configure the optimal provider stack based on your markets, transaction volumes, and fee sensitivity.\n\nBeyond basic card processing, we implement the full spectrum of European payment methods. iDEAL dominates in the Netherlands with over 60 percent of online transactions. Bancontact is essential for Belgian commerce. Klarna and SOFORT drive conversions in Germany and Scandinavia. Carte Bancaire captures French shoppers who might otherwise abandon checkout. SEPA direct debit handles recurring payments and B2B transactions efficiently across the eurozone.\n\nSecurity and compliance are non-negotiable. Every integration includes PSD2-compliant 3D Secure 2.0 authentication, PCI DSS scope reduction through tokenisation, webhook-driven payment status updates for reliable order management, and comprehensive transaction logging for reconciliation and dispute handling. We also implement fraud prevention rules tailored to European transaction patterns.",
      "f1": "Stripe integration with European card processing optimisation",
      "f2": "Mollie setup for iDEAL, Bancontact, and Belfius payments",
      "f3": "Adyen multi-method integration for enterprise merchants",
      "f4": "Klarna and SOFORT for German and Scandinavian markets",
      "f5": "SEPA direct debit for recurring and B2B transactions",
      "f6": "PSD2-compliant 3D Secure 2.0 authentication flows",
      "f7": "Webhook-driven order management and status synchronisation",
      "f8": "Fraud prevention rules tailored to European transaction patterns",
      "step1": "Payment landscape analysis identifying which methods your target customers prefer, comparing provider fees, and recommending the optimal payment stack for your markets.",
      "step2": "Provider account setup and API configuration. We handle merchant applications, API key management, and webhook endpoint development for reliable communication.",
      "step3": "Frontend checkout integration with smooth UX for each payment method, 3D Secure handling, error recovery flows, and mobile-optimised payment forms.",
      "step4": "End-to-end testing with real transactions across all configured methods, reconciliation verification, refund flow testing, and go-live with transaction monitoring."
    },
    "ecomSeo": {
      "title": "E-COMMERCE SEO",
      "desc": "Specialised search optimisation for online stores including product page SEO, category architecture, schema markup for rich results, and Google Shopping feed management for European markets.",
      "longDesc": "E-commerce SEO is a discipline unto itself. Product pages, category structures, faceted navigation, and constantly changing inventory create challenges that standard SEO approaches cannot address. We apply specialised e-commerce SEO strategies that drive qualified organic traffic to your product pages, capturing buyers at the moment they are ready to purchase.\n\nProduct page optimisation is where most e-commerce SEO value is won or lost. We craft unique, keyword-rich product descriptions that avoid manufacturer copy duplication. Title tags follow proven patterns that include product name, key attribute, and brand. Image alt text is written for both accessibility and image search visibility. Internal linking connects related products to distribute authority and encourage discovery.\n\nCategory and site architecture directly impact how search engines understand and rank your store. We design URL structures, breadcrumb hierarchies, and internal link patterns that distribute ranking authority effectively. Faceted navigation is handled with proper canonical tags and crawl directives to prevent index bloat from filter combinations. Pagination uses best-practice implementations that consolidate ranking signals.\n\nStructured data transforms your search listings from plain text into rich results that attract clicks. We implement Product schema with price, availability, and review data for enhanced snippets. Breadcrumb schema improves sitelink display. FAQ schema on category pages captures additional SERP real estate. For merchants selling in multiple EU countries, we configure hreflang and manage Google Merchant Center feeds for Shopping results in each target market.",
      "f1": "Product page SEO with unique descriptions and keyword targeting",
      "f2": "Category architecture optimisation for crawl efficiency",
      "f3": "Product schema markup for rich results with price and reviews",
      "f4": "Google Shopping feed setup and optimisation per market",
      "f5": "Faceted navigation SEO with canonical and crawl management",
      "f6": "Image SEO optimisation for Google Images product visibility",
      "f7": "Hreflang implementation for multilingual product catalogues",
      "f8": "Competitor product ranking analysis and gap identification",
      "step1": "E-commerce SEO audit covering product page quality, category structure, technical crawl issues, schema implementation, and current organic performance metrics.",
      "step2": "Keyword research focused on product and category terms with commercial intent. We identify high-value opportunities across all your target European markets.",
      "step3": "On-site implementation including product description rewrites, schema markup deployment, category restructuring, and Google Merchant Center feed configuration.",
      "step4": "Ongoing monitoring with monthly reports tracking product rankings, organic revenue attribution, Shopping performance, and actionable optimisation recommendations."
    },
    "ecomAnalytics": {
      "title": "E-COMMERCE ANALYTICS",
      "desc": "Comprehensive conversion tracking, revenue attribution, funnel analysis, and GA4 enhanced e-commerce implementation to transform your store data into actionable growth insights.",
      "longDesc": "Data without interpretation is noise. We implement comprehensive e-commerce analytics that give you clear visibility into what drives revenue, where customers drop off, and which marketing channels deliver the best return on investment. Every tracking decision is purposeful, designed to answer specific business questions rather than collect data for its own sake.\n\nGA4 enhanced e-commerce tracking is the foundation. We implement the full measurement protocol: product impressions, product clicks, add-to-cart events, checkout steps, purchase completions, and refund tracking. Each event carries rich product data including SKU, category, brand, variant, and price. This granularity enables analysis that reveals which products drive engagement, which categories underperform, and where in the purchase journey customers abandon.\n\nConversion funnel analysis identifies the exact friction points in your buying process. We build custom funnel reports that track progression from landing page through product view, cart addition, checkout initiation, payment entry, and order confirmation. Drop-off rates at each stage are benchmarked against industry averages for European e-commerce. A/B testing recommendations target the stages with the highest improvement potential.\n\nRevenue attribution connects every sale to its source. We configure cross-domain tracking, UTM parameter management, and multi-touch attribution models that account for the complex European buying journey. Customers who discover you through Google in Germany, research on social media, and convert via an email campaign days later are properly credited. Monthly dashboards present KPIs that matter: revenue per visitor, customer acquisition cost, average order value, and customer lifetime value by market.",
      "f1": "GA4 enhanced e-commerce with full event taxonomy",
      "f2": "Conversion funnel analysis with stage-by-stage drop-off metrics",
      "f3": "Revenue attribution across marketing channels and campaigns",
      "f4": "Custom dashboards in Looker Studio for real-time KPI monitoring",
      "f5": "A/B testing framework for checkout and product page optimisation",
      "f6": "Server-side tracking for accurate data despite ad blockers",
      "f7": "Cross-domain and cross-device tracking for complete user journeys",
      "f8": "GDPR-compliant analytics with consent mode v2 integration",
      "step1": "Analytics audit of your current tracking setup, identifying gaps in e-commerce event coverage, consent compliance issues, and missed attribution opportunities.",
      "step2": "Measurement plan defining every event, parameter, and custom dimension needed. Data layer specification is documented and agreed before any implementation begins.",
      "step3": "Implementation of GA4 enhanced e-commerce tags, server-side tracking container, consent mode configuration, and custom Looker Studio dashboards for your KPIs.",
      "step4": "Validation period with data quality checks, funnel accuracy verification, and team training on interpreting dashboards and extracting actionable insights from the data."
    }
  },
  "faq": {
    "shopifyDev1Q": "What is the difference between a custom Shopify theme and a pre-built theme?",
    "shopifyDev1A": "Pre-built themes offer generic layouts that thousands of stores share. A custom theme is designed exclusively for your brand with unique layouts, optimised conversion flows, and features tailored to your product catalogue and European customer expectations.",
    "shopifyDev2Q": "Do you work with Shopify Plus for enterprise clients?",
    "shopifyDev2A": "Yes. We are experienced with Shopify Plus features including checkout extensibility, Shopify Functions, multi-storefront management, and expansion stores for European markets. Plus is recommended for merchants processing over EUR 500,000 annually.",
    "shopifyDev3Q": "Can you migrate our existing store to Shopify?",
    "shopifyDev3A": "Absolutely. We handle migrations from WooCommerce, Magento, PrestaShop, and other platforms. Product data, customer accounts, order history, and SEO redirects are all managed to ensure zero disruption to your business.",
    "shopifyDev4Q": "What is headless Shopify with Hydrogen?",
    "shopifyDev4A": "Hydrogen is Shopify's React-based framework for building custom storefronts. It uses Shopify's backend for commerce logic while giving you complete frontend freedom. The result is ultra-fast page loads and a unique design unconstrained by theme limitations.",

    "wooDev1Q": "Why choose WooCommerce over Shopify for European e-commerce?",
    "wooDev1A": "WooCommerce offers full code ownership, no monthly platform fees, unlimited customisation, and no transaction fees beyond your payment provider's charges. It is ideal for businesses needing custom plugins, complex tax setups, or integration with specific European ERP systems.",
    "wooDev2Q": "Which payment gateways do you integrate with WooCommerce?",
    "wooDev2A": "We integrate Mollie (iDEAL, Bancontact, Belfius), Stripe, Adyen, Klarna, PayPal, and SEPA direct debit. Each gateway is configured with PSD2-compliant 3D Secure authentication and tested with real transactions before launch.",
    "wooDev3Q": "How do you handle EU VAT compliance in WooCommerce?",
    "wooDev3A": "We configure automatic VAT rate calculation per EU country, implement VAT number validation via VIES for B2B reverse charge, set up OSS reporting for cross-border sales, and ensure all invoices meet EU electronic invoicing requirements.",
    "wooDev4Q": "Can WooCommerce handle high traffic volumes?",
    "wooDev4A": "With proper hosting, caching, and optimisation, WooCommerce handles thousands of concurrent users. We configure Redis object caching, CDN delivery, database optimisation, and autoscaling infrastructure for peak traffic periods like Black Friday.",

    "customEcom1Q": "When should a business choose custom e-commerce over Shopify or WooCommerce?",
    "customEcom1A": "Custom development is the right choice when your business model requires unique checkout flows, complex product configurators, marketplace functionality, or deep integrations that standard platforms cannot accommodate without excessive workarounds.",
    "customEcom2Q": "What headless commerce backends do you work with?",
    "customEcom2A": "We work with Medusa.js for open-source flexibility, Saleor for GraphQL-first architecture, and Commercetools for enterprise-scale operations. Backend selection depends on your transaction volume, customisation needs, and budget.",
    "customEcom3Q": "How long does a custom e-commerce build take?",
    "customEcom3A": "A custom store typically takes 8 to 16 weeks depending on complexity. We work in two-week sprints with continuous delivery, so you see working functionality from week two onward rather than waiting for a big-bang launch.",
    "customEcom4Q": "What about ongoing maintenance for a custom store?",
    "customEcom4A": "We offer maintenance plans covering security updates, performance monitoring, bug fixes, and feature enhancements. Custom stores require more technical maintenance than hosted platforms, but you gain complete control and zero platform lock-in.",

    "b2bEcom1Q": "How does B2B e-commerce pricing work with customer-specific rates?",
    "b2bEcom1A": "Each customer account is assigned to a pricing tier with pre-negotiated rates. When buyers log in, they see only their contracted prices. Volume discounts are calculated automatically at checkout, and sales teams can override pricing for special orders.",
    "b2bEcom2Q": "Can the platform handle ordering by CSV upload?",
    "b2bEcom2A": "Yes. Bulk ordering supports CSV upload with SKU and quantity columns, quick-order forms for entering multiple products, and saved order templates for repeat purchases. These features are essential for B2B buyers who order dozens of items at once.",
    "b2bEcom3Q": "How do you handle VAT for cross-border B2B sales in the EU?",
    "b2bEcom3A": "We validate buyer VAT numbers against the EU VIES database in real time. Valid B2B buyers from other EU member states automatically receive reverse charge treatment with zero VAT. All transaction data is captured for Intrastat and EC Sales List reporting.",
    "b2bEcom4Q": "Can the B2B store integrate with our existing ERP system?",
    "b2bEcom4A": "Yes. We build integrations with SAP Business One, Microsoft Dynamics, Exact Online, and other European ERP systems. Product data, pricing, stock levels, and orders sync bidirectionally so your online store and back-office stay aligned.",

    "multiCurrency1Q": "How do you handle currency conversion without losing margin?",
    "multiCurrency1A": "We set market-specific prices manually rather than using live exchange rates. This protects your margins from currency fluctuations. Prices are reviewed quarterly and adjusted based on exchange rate movements, competitive positioning, and local market conditions.",
    "multiCurrency2Q": "Which EU countries require separate VAT registration?",
    "multiCurrency2A": "Under the OSS scheme, you can report all EU distance sales through a single registration if your cross-border sales exceed EUR 10,000 annually. We configure your store to calculate the correct VAT rate per destination country automatically.",
    "multiCurrency3Q": "Do you support non-euro currencies like GBP, CHF, and SEK?",
    "multiCurrency3A": "Yes. We configure stores with any currency combination needed. British pounds, Swiss francs, Swedish krona, Danish krone, and Polish zloty are all supported alongside the euro. Each currency gets its own pricing, rounding rules, and display format.",
    "multiCurrency4Q": "How does geo-detection work for automatic market selection?",
    "multiCurrency4A": "We use IP-based geolocation to detect the visitor's country and automatically display the appropriate language, currency, and shipping options. Customers can always override this selection manually. A cookie remembers their preference for return visits.",

    "paymentInt1Q": "Which payment method has the highest conversion rate in Europe?",
    "paymentInt1A": "It varies by country. iDEAL converts at over 90 percent in the Netherlands, Bancontact dominates Belgium, and Klarna leads in Germany and Scandinavia. Card payments remain important across all markets. We recommend offering three to four methods per market.",
    "paymentInt2Q": "What is PSD2 and how does it affect our checkout?",
    "paymentInt2A": "PSD2 requires Strong Customer Authentication for European card payments, typically via 3D Secure 2.0. We implement frictionless authentication flows that minimise checkout abandonment while meeting regulatory requirements. Exemptions are applied where eligible.",
    "paymentInt3Q": "How do you handle recurring payments and subscriptions?",
    "paymentInt3A": "We implement SEPA direct debit for eurozone recurring payments and Stripe's subscription billing for card-based recurring charges. Mandate management, payment retry logic, and dunning workflows are all configured to minimise involuntary churn.",
    "paymentInt4Q": "What happens if a payment provider has downtime?",
    "paymentInt4A": "We configure fallback payment routes where possible. If Mollie experiences downtime, customers can still pay via Stripe. Webhook-based status tracking ensures orders are not lost during provider interruptions. Alert monitoring notifies you immediately of any issues.",

    "ecomSeo1Q": "How is e-commerce SEO different from regular website SEO?",
    "ecomSeo1A": "E-commerce SEO involves product schema markup, faceted navigation management, thin content on product pages, index bloat from filter combinations, and Google Shopping feed optimisation. These challenges require specialised techniques beyond standard on-page SEO.",
    "ecomSeo2Q": "Can you optimise our Google Shopping listings?",
    "ecomSeo2A": "Yes. We set up and optimise your Google Merchant Center feed with proper product titles, descriptions, GTINs, and pricing data. Feed rules ensure your products show correctly across all target markets with localised pricing and availability.",
    "ecomSeo3Q": "How do you handle SEO for products with many variants?",
    "ecomSeo3A": "We implement canonical URLs to consolidate ranking signals across variants, use structured data to surface variant options in search results, and create optimised descriptions that target variant-specific search queries like colour or size combinations.",
    "ecomSeo4Q": "What results can we expect from e-commerce SEO?",
    "ecomSeo4A": "Typically, we see 30 to 80 percent increases in organic product page traffic within six months. Product rich results improve click-through rates by 20 to 35 percent. Google Shopping feed optimisation can double impression share in target markets.",

    "ecomAnalytics1Q": "What is GA4 enhanced e-commerce tracking?",
    "ecomAnalytics1A": "Enhanced e-commerce tracks the complete shopping journey: product views, add-to-cart actions, checkout steps, purchases, and refunds. Each event carries product details enabling analysis of which products, categories, and price points drive revenue.",
    "ecomAnalytics2Q": "How do you handle tracking accuracy with ad blockers?",
    "ecomAnalytics2A": "We implement server-side tracking through Google Tag Manager's server container. This routes analytics data through your own domain, bypassing most ad blockers. Consent mode v2 ensures GDPR compliance while recovering up to 70 percent of blocked data.",
    "ecomAnalytics3Q": "What KPIs should an e-commerce store track?",
    "ecomAnalytics3A": "Essential KPIs include conversion rate, average order value, revenue per visitor, cart abandonment rate, customer acquisition cost, and customer lifetime value. We build dashboards that surface these metrics by market, channel, and device for European stores.",
    "ecomAnalytics4Q": "Can you set up analytics for stores selling in multiple EU countries?",
    "ecomAnalytics4A": "Yes. We configure market-segmented reporting so you can compare performance across countries. Cross-domain tracking handles multi-language storefronts, and currency normalisation ensures revenue comparisons are accurate regardless of the transaction currency."
  }
}